Tekla Open API Reference for Tekla Structures 2025
UnitAttributes Properties
The UnitAttributes type exposes the following members.
Properties
Name | Description
Format
 Gets or sets the format to use.
Unit
 Gets or sets the unit to use.
Top
See Also
Reference
UnitAttributes Class
Tekla.Structures.Drawing Namespace